Revit 2026 API

# TextTreatment Enumeration

---

An enumerated type listing possible text treatment modes.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TextTreatment
```
```vb
Public Enumeration TextTreatment
```
```cpp
public enum class TextTreatment
```
```fsharp
type TextTreatment
```

| Member name | Value | Description |
| --- | --- | --- |
| Approximate | 1 | Export texts as approximate visual fidelity. Formatting intelligence will be maintained. |
| Exact | 0 | Export texts as exact visual fidelity. Formatting intelligence will be lost. |

#### Reference

Autodesk.Revit.DB Namespace